# Business Problem

* For this project, you have been hired to produce a MySQL database on Movies from a subset of IMDB's publicly available dataset. 
* Ultimately, you will use this database to analyze what makes a movie successful, and will provide recommendations to the stakeholder on how to make a successful movie.

# Specifications - Database

Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project and wants you to create a MySQL database for them.

Specifically, they want the data from the following files included in your database:

**Title Basics:**
* Movie ID (tconst)
* Primary Title
* Start Year
* Runtime (in Minutes)
* Genres
**Title Ratings**
* Movie ID (tconst)
* Average Movie Rating
* Number of Votes

**The TMDB API Results (multiple files)**
* Movie ID
* Revenue
* Budget
* Certification (MPAA Rating)

In [1]:
import pandas as pd
import json
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import warnings 
warnings.filterwarnings("ignore")

In [2]:
title_basics = pd.read_csv("/Users/obsid/OneDrive/Documents/GitHub/Project-3-Part-1/Data/title_basics.csv.gz")
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [3]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86753 entries, 0 to 86752
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86753 non-null  object
 1   titleType       86753 non-null  object
 2   primaryTitle    86753 non-null  object
 3   originalTitle   86753 non-null  object
 4   isAdult         86753 non-null  int64
 5   startYear       86753 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86753 non-null  int64
 8   genres          86753 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 6.0+ MB

In [4]:
title_ratings = pd.read_csv("/Users/obsid/OneDrive/Documents/GitHub/Project-3-Part-1/Data/title_ratings.csv.gz")
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1978
1  tt0000002            5.8       265
2  tt0000005            6.2      2621
3  tt0000006            5.1       182
4  tt0000007            5.4       821

# Required Transformation Steps for Title Basics:

**Normalize Genre:**

Convert the single string of genres from title basics into 2 new tables.
1. title_genres: with the columns:
    - tconst
    - genre_id
 
2. genres
    - genre_id
    - genre_name

In [5]:
title_basics["genres_split"] = title_basics["genres"].str.split(',')
title_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History","[Drama, History]"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
86748,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
86749,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86750,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
86751,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86752,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [6]:
exploded = title_basics.explode("genres_split")
exploded[["genres_split"]].head()

  genres_split
0       Comedy
0      Fantasy
0      Romance
1        Drama
1      History

In [7]:
unique_genres = sorted(exploded["genres_split"].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

# Create a genre mapper dictionary to replace string genres with integers

In [8]:
# Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [9]:
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

# Replace the string genres in title_genres with the new integer ids.

In [10]:
## make new integer genre_id and drop string genres
title_basics["genre_id"] = title_basics["genres_split"].replace(genre_map)
title_basics = title_basics.drop(columns="genres_split")

In [11]:
# Manually make a dataframe with name cols from the .key and .values
genre_lookup =pd.DataFrame({"Genre_Name": genre_id_map.keys(),"Genre_Id":genre_id_map.values()})
genre_lookup.head()

  Genre_Name  Genre_Id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [12]:
title_basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres', 'genre_id'],
      dtype='object')

In [13]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86753 entries, 0 to 86752
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86753 non-null  object
 1   titleType       86753 non-null  object
 2   primaryTitle    86753 non-null  object
 3   originalTitle   86753 non-null  object
 4   isAdult         86753 non-null  int64
 5   startYear       86753 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86753 non-null  int64
 8   genres          86753 non-null  object
 9   genre_id        86753 non-null  object
dtypes: float64(1), int64(3), object(6)
memory usage: 6.6+ MB

In [14]:
save = ["tconst", "primaryTitle", "startYear", "genres", "runtimeMinutes"]
title_basics = title_basics[save]
title_basics.head()

,tconst,primaryTitle,startYear,genres,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,"Comedy,Fantasy,Romance",118
1,tt0043139,Life of a Beijing Policeman,2013,"Drama,History",120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,Drama,70
3,tt0069049,The Other Side of the Wind,2018,Drama,122
4,tt0088751,The Naked Monster,2005,"Comedy,Horror,Sci-Fi",100

# Create Title Ratings table

In [17]:
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1978
1  tt0000002            5.8       265
2  tt0000005            6.2      2621
3  tt0000006            5.1       182
4  tt0000007            5.4       821

# Create TMDB Table results

In [20]:
tmdb_data_api = pd.read_csv("/Users/obsid/Efficient-TMDB-API-Calls/Data/tmdb_results_combined.csv.gz")
tmdb_data_api.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2221.0,PG
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.100,181.0,R
3,tt0120263,0.0,/ynXVuylP8upazjz8lrqb1PEMkdR.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,34070.0,sv,Sånger från andra våningen,...,80334.0,99.0,"[{'english_name': 'Russian', 'iso_639_1': 'ru'...",Released,NaN,Songs from the Second Floor,0.0,7.200,239.0,NaN
4,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.500,44.0,R

In [21]:
tmdb_data_api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 638 entries, 0 to 637
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                638 non-null    object
 1   adult                  638 non-null    float64
 2   backdrop_path          541 non-null    object
 3   belongs_to_collection  110 non-null    object
 4   budget                 638 non-null    float64
 5   genres                 638 non-null    object
 6   homepage               76 non-null     object
 7   id                     638 non-null    float64
 8   original_language      638 non-null    object
 9   original_title         638 non-null    object
 10  overview               636 non-null    object
 11  popularity             638 non-null    float64
 12  poster_path            619 non-null    object
 13  production_companies   638 non-null    object
 14  production_countries   638 non-null    object
 15  release_date           637 non-null    object
 16  revenue                638 non-null    float64
 17  runtime                638 non-null    float64
 18  spoken_languages       638 non-null    object
 19  status                 638 non-null    object
 20  tagline                499 non-null    object
 21  title                  638 non-null    object
 22  video                  638 non-null    float64
 23  vote_average           638 non-null    float64
 24  vote_count             638 non-null    float64
 25  certification          430 non-null    object
dtypes: float64(9), object(17)
memory usage: 129.7+ KB

# only need to keep the imdb_id, revenue, budget, and certification columns

In [24]:
save_these = ["imdb_id","revenue","budget","certification"]
tmdb_data_api = tmdb_data_api[save_these]
tmdb_data_api.head()

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0           NaN
1  tt0118694  14204632.0    150000.0            PG
2  tt0119273         0.0  15000000.0             R
3  tt0120263     80334.0         0.0           NaN
4  tt0120467     14904.0    120000.0             R

In [32]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "root" # (or whatever password you chose during mysql installation)
db_name = "Movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [33]:
# Create Engine
engine = create_engine(connection)

In [34]:
#create new database that didn't exist
if database_exists(connection) == False:
    create_database(connection)
    print('Database created.')
else:
    print("The database already exists.")

The database already exists.

In [30]:
#check with query
q = """
SHOW TABLES;
"""

In [31]:
pd.read_sql(q,engine)

Empty DataFrame
Columns: [Tables_in_movies]
Index: []

# Saving the MySQL tables with tconst as the primary key.

In [15]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [16]:
# Save to sql with dtype and index=False
title_basics.to_sql("title_basics",engine,dtype=df_schema,if_exists="replace",index=False)

NameError: name 'engine' is not defined